Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_instance.this: Refreshing state... [id=i-051faeadfef43635b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_instance.this will be updated in-place
~ resource "aws_instance" "this" {
        id                                   = "i-051faeadfef43635b"
      ~ tags                                 = {
          ~ "Name" = "terraform-atlantis" -> "terraform-atlantis-demo"
        }
      ~ tags_all                             = {
          ~ "Name" = "terraform-atlantis" -> "terraform-atlantis-demo"
        }
        # (28 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_s3_bucket.example will be created
+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-tf-test-bucket-9876random"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ceba00f59225:4141/lock?id=vjaydevops%252Fterraform-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`